//JOI국에는 n개의 섬이 있으며 각 섬에는 1에서 n까지의 번호가 매겨져 있다.
// 현재 JOI국에서는 각 섬 사이를 잇는 항로망의 정비가 진행되고 있다.
//당신은 선박 표를 취급하는 티켓 센터에서 근무한다.
// JOI 국가에는 선박을 이용해서 가능한 한 싼 값에 섬과 섬 사이를 여행하고 싶어 한다.
// 그들은 여행지와 목적지를 주문표에 기입해서 당신에게 보낼 것이다.
//당신의 업무는 손님으로부터 주문표를 받는 즉시 여러 선박을 갈아타서 여행지와 목적지를 잇는 항로에서 가장 싼 운임을 계산하여 고객에게 전달하는 것이다.
//단, 여행 일정에 따라서는 선박으로 여행할 수 없는 경우도 있다. 그때는 '선박으로 여행할 수 없다'고 손님에게 말해야 한다.
// 또한 JOI국에서는 섬과 섬 사이를 연결하는 새로운 선박이 잇달아 운항을 시작하고 있어, 당신에게 그 정보가 수시로 전달된다.
// 손님에게 대답을 할 때는 최신 정보에 유의해야 한다.
//당신의 주문과 새로 운항을 시작한 선박에 대한 정보가 제공될 때 당신의 대답을 구할 수 있는 프로그램을 입력하세요.
//또한 입력 예1과 출력 예1에 대한 실행 상황을 그림 1로 나타내고 있다.